<a href="https://colab.research.google.com/github/Amogh-OKKK/data_analytics_using_python/blob/main/dataanalytics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

In [20]:
tt = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
tt.head(4)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S

[4 rows x 12 columns]

In [11]:
tt.shape

(891, 12)

In [19]:
tt.tail(4)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[4 rows x 12 columns]

In [18]:
a=tt.isnull().sum()
a

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
b=x[x>(15/100 *tt.shape[0])]
b

Age      177
Cabin    687
dtype: int64

In [30]:
tt.fillna(1,inplace=True)
tt.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64